"""Odia alphabet"""
__author__ = 'Nishchith Shetty <inishchith[at]gmail[.]com>'

VOWELS = [
    'ଅ', 'ଆ', 'ଇ', 'ଈ', 'ଉ', 'ଊ', 'ଋ',
    'ୠ', 'ଌ', 'ୡ', 'ଏ', 'ଐ', 'ଓ', 'ଔ']

STRUCTURED_CONSONANTS = [
    'କ', 'ଖ', 'ଗ', 'ଘ', 'ଙ',
    'ଚ', 'ଛ', 'ଜ', 'ଝ', 'ଞ',
    'ଟ', 'ଠ', 'ଡ', 'ଢ', 'ଣ',
    'ତ', 'ଥ', 'ଦ', 'ଧ', 'ନ',
    'ପ', 'ଫ', 'ବ', 'ଭ', 'ମ']

UNSTRUCTURED_CONSONANTS = [
    'ଯ', 'ୟ', 'ର', 'ଲ', 'ଳ', 'ୱ',
    'ଶ', 'ଷ', 'ସ', 'ହ', 'କ୍ଷ']

NUMERALS = [
    '୦', '୧', '୨', '୩', '୪',
    '୫', '୬', '୭', '୮', '୯']
