"""The Hebrew alphabet.

References:
* https://en.wikipedia.org/wiki/Hebrew_numerals
* https://www.omniglot.com/writing/hebrew.htm
* https://www.duolingo.com/comment/7253301/Hebrew-Time-8-The-Hebrew-Vowels
"""

DIGITS = ['א','ב','ג','ד','ה','ו','ז','ח','ט','י','יא‬','יב','יג','יד‬','ט״ו‬','ט״ז‬','יז‬','יח‬','יט‬','כ','ל','מ','נ','ס','ע','פ','צ','ק','ר', 'ש', 'ת','ך‬','ם‬','ן‬','ף‬','ץ‬','א׳‬','ב׳‬','ה׳‬','א׳י‬	','א׳ק‬','א׳א׳‬	']

ALPHABET = ['ז', 'ו', 'ה', 'ד', 'ג', 'בּ/ב', 'א', 'מ', 'ל', 'ך', 'כּ/כ', 'י', 'ט', 'ח', 'ף', 'פּ/פ', 'ע', 'ס', 'ן', 'נ', 'ם', 'ת', 'שׁ/שׂ', 'ר', 'ק', 'ץ', 'צ', "'ת", "'צ", "'ע", "'ח", "'ז", "'ד", "'ג"] 

VOWELS = ['אְ', 'אִ', 'אֵ', 'אֶ', 'אָ', 'אַ', 'ׂא', 'וֹ', 'אֻ', 'וּ', 'תּ', 'שׁ', 'שׂ', 'אֱ', 'אֲ', "אֳ"]
