"""Telugu alphabet

TODO: Add tests.
"""
__author__ = "Nishchith Shetty <inishchith[at]gmail[dot]com>"

VOWELS = [
    "అ ",
    "ఆ",
    "ఇ",
    "ఈ ",
    "ఉ ",
    "ఊ ",
    "ఋ  ",
    "ౠ  ",
    "ఌ ",
    "ౡ",
    "ఎ",
    "ఏ",
    "ఐ",
    "ఒ",
    "ఓ",
    "ఔ ",
    "అం",
    "అః",
]

CONSONANTS = [
    "క",
    "ఖ",
    "గ",
    "ఘ",
    "ఙ" "చ",
    "ఛ",
    "జ",
    "ఝ",
    "ఞ",
    "ట",
    "ఠ",
    "డ ",
    "ఢ",
    "ణ",
    "త",
    "థ",
    "ద",
    "ధ",
    "న",
    "ప",
    "ఫ",
    "బ",
    "భ",
    "మ",
    "య",
    "ర",
    "ల",
    "వ",
    "శ",
    "ష",
    "స ",
    "హ",
    "ళ",
    "క్ష ",
    "ఱ",
]

NUMERLALS = ["౦", "౧", "౨", "౩", "౪	", "౫", "౬", "౭", "౮", "౯"]
