""" Basic model for Greek lemmatization
- Composed of unambiguous tokens from high frequency lemmas and function words 
- Wordlists for particles and prepositions based on Smyth; ambiguous forms removed; cf. http://www.perseus.tufts.edu/hopper/text?doc=Perseus%3Atext%3A1999.04.0007%3Apart%3D1%3Achapter%3D1%3Asection%3D1; initial list of forms taken from Morpheus lemma list
"""

__author__ = ['Patrick J. Burns <patrick@diyclassics.org>']
__license__ = 'MIT License. See LICENSE.'

from collections import ChainMap

## LEMMA/TOKEN MAPS

_PARTICLES = [
    {'διόπερ': ['διόπερ']}, 
    {'διότι': ['διότι', 'διότιπερ']}, 
    {'ἐάν': ['ὥνπερ', 'ἐάνθ', 'ἄνπερ', 'αἴκ', 'ἤν', 'αἴκα', 'αἴχ', 'ἐάντε', 'ἐάντ', 'ἐάνπερ', 'ἐάν', 'καἴκα']}, 
    {'εἰ': ['αἰ', 'αἶ', 'κεἴ', 'εἰ', 'καἰ', 'εἴ', 'κεἰ', 'εἴγ', 'αἴ', 'εἴγε', 'αἰδέ', 'εἶπερ', 'εἵ', 'καἴ']}, 
    {'ἔνθα': ['ἔνθα']}, 
    {'ἐπεί': ['ἐπειδή', 'πειδή', 'κἀπεί', 'ἐπείτε', 'πειδήπερ', 'ἐπεί', 'κἠπεί', 'ἐπείπερ', 'ἐπειδήπερ', 'ἐπείτ', 'κἀπειδή', 'κἀπειδήπερ']}, 
    {'ἔστε': ['ἔστεπερ']}, 
    {'ἕως': ['εἵως', 'ἧος']}, 
    {'ἤν': ['ἠνίδε', 'ἠνίδ']}, 
    {'ἡνίκα': ['ἡνίκα', 'ἡνίχ', 'ἡνίκαπερ', 'ἁνίκα', 'ἁνίκ', 'ἁνίχ', 'ἡνίκ']}, 
    {'ἵνα': ['ἵναπερ', 'ἵνα', 'ἵν']}, 
    {'μέχρι': ['μέχρις', 'μέχριπερ', 'μέχρι']}, 
    {'μή': ['μή', 'μήπερ']}, 
    {'ὅθεν': ['ὅθεν', 'χὤθεν', 'ὅθενπερ']}, 
    {'ὁθούνεκα': ['ὁθούνεκα', 'ὁθούνεχ', 'ὁθούνεκ']}, 
    {'ὁπόθεν': ['ὁπόθεν', 'χὠπόθεν', 'ὁκόθεν', 'χὡπόθεν', 'ὁποθενοῦν', 'ὁππόθεν']}, 
    {'ὅποι': ['ὅποι', 'ὅκοι', 'ὅποιπερ']}, 
    {'ὁπότε': ['χὠπότε', 'χὠπότ', 'ὁκότ', 'ὁπότε', 'ὁππόθ', 'ὁππότ', 'ὁππότε', 'ὁκότε', 'ὁπότ']}, 
    {'ὅπου': ['χὤπου', 'ὅπουπερ', 'ὅπου', 'ὁπουοῦν', 'ὅκου']}, 
    {'ὅπως': ['ὁπωσδή', 'ὁπωσδήποτε', 'ὅπως', 'ὅκωσπερ', 'ὅκως', 'ὅπωσπερ', 'χὥπως', 'ὅππως', 'ὁπωσδήποτ', 'χὤπως']}, 
    {'ὅτε': ['ὄτα', 'ὅχ', 'ὅκ', 'ὄτ', 'ὁτ', 'ὁτέ']}, 
    {'οὕνεκα': ['οὕνεκα', 'οὕνεκεν', 'οὕνεκ', 'οὕνεχ']}, 
    {'πρίν': ['πρίν']}, 
    {'ὡς': ['ὧσπερ', 'ὡσπερ', 'ὧς', 'ὡς', 'χὠς']}, 
    {'ὥσπερ': ['ὡσπερεί', 'ὡσπερανεί', 'ὥσπερ']},
]

_PREPOSITIONS = [
{'ἀμφί': ['κἀμφί', 'ἀμφ', 'τἀμφί', 'ἀμφί']}, 
{'ἀνά': ['ὧμπερ', 'ἆν', 'ὤγ', 'ἀν', 'ἄγ', 'ὧμ', 'ἀνά', 'δἄν', 'τἀνά', 'κἀνά', 'ἄν', 'ἄμ', 'ὥν', 'ἅγ']}, 
{'ἀντί': ['ἀντί', 'ἀντ']}, 
{'ἀπό': ['τὠπό', 'ἄπο', 'ἄπ', 'τἀπ', 'π', 'ἀπό', 'κἀπ', 'κἀφ', 'τἀπό', 'κἀπό', 'πό', 'ἀπ', 'τἀφ', 'ἀπαί', 'ἀφ', 'φ', 'ἄφ', 'ἁπό']}, 
{'διά': ['διαί']}, 
{'ἐκ': ['μοὐκ', 'οὗκ', 'κἠξ', 'κἀκ', 'κἠκ', 'οὑκ', 'τἀκ', 'ἅκ', 'τὠκ', 'ἐξ', 'ξ', 'ἐκ', 'ἔκ', 'ἔξ', 'τοὐξ', 'οὑξ', 'κἀξ', 'τἀξ', 'κ', 'κἄκ']}, 
{'ἐν': ['ἐνί', 'κἦν', 'ἔνι', 'κἠμ', 'ν', 'κἠν', 'εἰνί', 'εἰν', 'ἐν', 'τοὐμ', 'κεἰν', 'κἀν', 'δἦν', 'εἴν', 'κἀν', 'ἔν', 'ἁμ', 'μοὖν', 'ἐμ', 'οὑν', 'ἔμ', 'τἀν', 'εἶν', 'ἐν', 'οὗν', 'εἵν', 'τοὐν', 'ἅμ']}, 
{'ἐπί': ['ἐπί', 'τοὐπί', 'κἠφ', 'ἔπ', 'οὑφ', 'μοὐπ', 'τἀπί', 'ἐπίπερ', 'κἠπ', 'ἔπι', 'ἔφ', 'ἐφ', 'οὑπί', 'κἀπί', 'πι', 'τοὐπ', 'κἠπί', 'τοὐφ', 'πί', 'ἐπ', 'οὑπ']}, 
{'κατά': ['κάγ', 'κάμ', 'κατά', 'κάπ', 'κάκ', 'κάτ', 'κάδ', 'καθ', 'κάλ', 'κατ']}, 
{'μετά': ['μεθ', 'πεδά', 'μέτα', 'πεδ', 'μετ', 'μέτ', 'μετά']}, 
{'παρά': ['πάρα', 'πάρ']}, 
{'περί': ['περ', 'πέρι', 'περί', 'περὶ']}, 
{'πρό': ['πρό', 'προπρό']}, 
{'πρός': ['προτί', 'πρός', 'ποτί']}, 
{'σύν': ['σύν', 'ξύν']}, 
{'ὑπέρ': ['ὑπερτάτως', 'ὑπέρτατε', 'ὑπερτάτη', 'ὑπείρ', 'ὑπέρτεροι', 'ὑπερτάταις', 'ὑπερτάταν', 'ὑπερτάτων', 'ὑπερτέρως', 'ὑπερτάτου', 'ὕπερ', 'ὑπερτάτοισιν', 'ὑπερτάτᾳ', 'ὑπερτάτω', 'ὑπέρτατος', 'ὑπερτέροις', 'ὑπερτέρᾳ', 'ὑπερτέρω', 'ὑπερτέρου', 'ὑπέρτερος', 'ὑπερτάτῃ', 'ὑπερτάτους', 'ὑπερτάτην', 'ὑπέρ', 'χὐπέρ', 'ὑπερτάτωι', 'ὑπερτέραις', 'ὑπερτέρῳ', 'ὑπέρτερα', 'οὕπερ', 'ὑπεράγαν', 'ὑπερτέρα', 'ὑπερτάτης', 'ὑπερτάτας', 'ὑπερτέρη', 'ὑπέρτατον', 'ὑπερτέρην', 'ὑπέρτερε', 'ὑπερτέραν', 'ὑπερτέρων', 'ὑπερτάτῳ', 'ὑπέρτεραι', 'ὑπερτέρας', 'ὑπερτάτηι', 'ὑπέρτερον', 'ὑπέρτατα', 'ὑπέρτατοι', 'ὑπέρταται', 'ὑπερτέρους', 'ὑπερτάτοις']}, 
{'ὑπό': ['ὕπ', 'χὐπό', 'ὗπ', 'ὑφ', 'ὑπό', 'ὕφ', 'ὑπ', 'ὕπο', 'ὐπά', 'ὐπ', 'ὑπαί']},
]

PUNCTUATION = ['!', '"', '#', '$', '%', '&', "'", '(', ')', '*', '+', ',', '-', '.', '/', ':', ';', '<', '=', '>', '?', '@', '[', '\\', ']', '^', '_', '`', '{', '|', '}', '~', '·']

# IRREGULAR VERBS DRAWN ORIGINALLY FROM MORPHEUS LEMMAS
IRREGULAR_AMBIGUOUS = ['εἶς', 'ἔμεν', 'ἔμμεν', 'ἦι', 'ἦις', 'ᾖ', 'ᾖς', 'στι', 'στ', 'ἴν', 'ὦ']

EIMI_SUM = ['έν', 'έσται', 'έστιν', 'ειμεν', 'ειμι', 'εισι', 'εμεν', 'ενθ', 'εντι', 'εσσι', 'εστί', 'εστίν', 'εστε', 'εστι', 'εστιν', 'εστον', 'εστ', 'εἰμέν', 'εἰμί', 'εἰμεν', 'εἰμι', 'εἰμ', 'εἰς', 'εἰσί', 'εἰσίν', 'εἰσι', 'εἰσιν', 'εἴαθ', 'εἴατο', 'εἴη', 'εἴημεν', 'εἴην', 'εἴης', 'εἴησαν', 'εἴητε', 'εἴητον', 'εἴητ', 'εἴμεναι', 'εἴμι', 'εἴμ', 'εἴς', 'εἴσι', 'εἴσιν', 'εἴτην', 'εἴω', 'εἵμεναι', 'εἶεν', 'εἶθ', 'εἶμεν', 'εἶναι', 'εἶν', 'εἶς', 'εἶτε', 'εἶτον', 'εἶτ', 'εὖντα', 'κεἰμί', 'κἀντί', 'κἀντ', 'κἀστί', 'κἀστίν', 'κἀστόν', 'κἄμμ', 'κἄνθ', 'κἄσθ', 'κἄστι', 'κἄστιν', 'κἄστ', 'κἠστί', 'κἤν', 'κὦ', 'κᾆθ', 'κᾆτ', 'μοὔσθ', 'μοὐστί', 'μοὐστίν', 'μοὔσθ', 'μοὔστι', 'μοὔστιν', 'μἤστι', 'οὔσας', 'οὖς', 'οἶσα', 'οἶσαι', 'οἶσι', 'οἶσιν', 'οὐσῶν', 'οὔσα', 'οὔσαιν', 'οὔσαις', 'οὔσας', 'οὔσηι', 'οὔσης', 'οὔσῃ', 'οὖς', 'οὖσα', 'οὖσαι', 'οὖσαν', 'οὖσι', 'οὖσιν', 'σοὐστί', 'σοὐστίν', 'σοὔστι', 'τοὔν', 'τοὐστί', 'τοὔν', 'τἄν', 'ἅσθ', 'ἅστε', 'ἅω', 'ἐμέν', 'ἐμεν', 'ἐμμί', 'ἐμμι', 'ἐνθ', 'ἐντί', 'ἐντι', 'ἐντ', 'ἐοίσαις', 'ἐοίσας', 'ἐοῦς', 'ἐουσέων', 'ἐουσᾶν', 'ἐουσῶν', 'ἐούσαις', 'ἐούσας', 'ἐούσης', 'ἐούσῃ', 'ἐούσῃσι', 'ἐούσῃσιν', 'ἐοῖσα', 'ἐοῖσαι', 'ἐοῖσαν', 'ἐοῖσιν', 'ἐοῦς', 'ἐοῦσα', 'ἐοῦσαι', 'ἐοῦσαν', 'ἐοῦσι', 'ἐοῦσιν', 'ἐσθ', 'ἐσμέν', 'ἐσμεν', 'ἐσοίμεθα', 'ἐσοίμην', 'ἐσομέναις', 'ἐσομένας', 'ἐσομένη', 'ἐσομένηι', 'ἐσομένην', 'ἐσομένης', 'ἐσομένοις', 'ἐσομένου', 'ἐσομένους', 'ἐσομένων', 'ἐσομένῃ', 'ἐσομένῳ', 'ἐσοῦμαι', 'ἐσοῦνται', 'ἐσς', 'ἐσσί', 'ἐσσίν', 'ἐσσίονται', 'ἐσσεῖθ', 'ἐσσεῖται', 'ἐσσι', 'ἐσσιν', 'ἐσσομένας', 'ἐσσομένη', 'ἐσσομένην', 'ἐσσομένης', 'ἐσσομένοιο', 'ἐσσομένοις', 'ἐσσομένοισι', 'ἐσσομένοισιν', 'ἐσσομένου', 'ἐσσομένων', 'ἐσσομένῃ', 'ἐσσομένῃσι', 'ἐσσομένῃσιν', 'ἐσσομένῳ', 'ἐσσουμένων', 'ἐσσοῦνται', 'ἐσσόμεθα', 'ἐσσόμεθ', 'ἐσσόμενα', 'ἐσσόμενε', 'ἐσσόμενον', 'ἐσσόμενος', 'ἐσσόμεν', 'ἐσσόμεσθα', 'ἐσσῇ', 'ἐστέ', 'ἐστί', 'ἐστίν', 'ἐστε', 'ἐστι', 'ἐστιν', 'ἐστον', 'ἐστόν', 'ἐστ', 'ἐσόμεθα', 'ἐσόμεθ', 'ἐσόμενα', 'ἐσόμεναι', 'ἐσόμενοι', 'ἐσόμενον', 'ἐσόμενος', 'ἐσόμεσθα', 'ἐόν', 'ἐόνθ', 'ἐόντα', 'ἐόντας', 'ἐόντε', 'ἐόντες', 'ἐόντεσσιν', 'ἐόντι', 'ἐόντος', 'ἐόντων', 'ἐόντ', 'ἐών', 'ἔα', 'ἔας', 'ἔασι', 'ἔασιν', 'ἔατε', 'ἔηι', 'ἔην', 'ἔησθα', 'ἔησι', 'ἔησιν', 'ἔμεν', 'ἔμεναι', 'ἔμεν', 'ἔμμεν', 'ἔμμεναι', 'ἔμμεν', 'ἔμμι', 'ἔν', 'ἔνθ', 'ἔντι', 'ἔντ', 'ἔοι', 'ἔοις', 'ἔον', 'ἔσαν', 'ἔσεαι', 'ἔσει', 'ἔσεσθαι', 'ἔσεσθε', 'ἔσεσθον', 'ἔσεσθ', 'ἔσεται', 'ἔσετ', 'ἔσε', 'ἔσηι', 'ἔσθ', 'ἔσκε', 'ἔσκεν', 'ἔσκες', 'ἔσκετε', 'ἔσκον', 'ἔσκ', 'ἔσμεν', 'ἔσοιθ', 'ἔσοιντο', 'ἔσοιο', 'ἔσοιτο', 'ἔσοιτ', 'ἔσομαι', 'ἔσομ', 'ἔσονται', 'ἔσοντ', 'ἔσς', 'ἔσσεαι', 'ἔσσεθ', 'ἔσσεσθαι', 'ἔσσεσθε', 'ἔσσεσθ', 'ἔσσεται', 'ἔσσετ', 'ἔσσηι', 'ἔσσι', 'ἔσσο', 'ἔσσομαι', 'ἔσσομ', 'ἔσσονθ', 'ἔσσονται', 'ἔσσοντ', 'ἔσσῃ', 'ἔσται', 'ἔστε', 'ἔστι', 'ἔστιν', 'ἔστον', 'ἔστων', 'ἔστωσαν', 'ἔστ', 'ἔσχ', 'ἔσῃ', 'ἔω', 'ἔωμεν', 'ἔωντι', 'ἔωσι', 'ἔωσιν', 'ἔῃ', 'ἔῃς', 'ἔῃσι', 'ἔῃσιν', 'ἔ', 'ἤην', 'ἤμην', 'ἤστην', 'ἤτην', 'ἤτω', 'ἦ', 'ἦα', 'ἦεν', 'ἦθ', 'ἦι', 'ἦις', 'ἦις', 'ἦισι', 'ἦμεν', 'ἦμες', 'ἦν', 'ἦς', 'ἦσαν', 'ἦσθα', 'ἦσθε', 'ἦσθ', 'ἦσι', 'ἦσιν', 'ἦστε', 'ἦστον', 'ἦστ', 'ἦτε', 'ἦτον', 'ἦτ', 'ἰοίσας', 'ἰοῖς', 'ἰοῦς', 'ἰουσῶν', 'ἰούσαις', 'ἰούσας', 'ἰοῖς', 'ἰοῖσα', 'ἰοῖσαι', 'ἰοῖσι', 'ἰοῖσιν', 'ἰοῦς', 'ἰοῦσα', 'ἰοῦσαι', 'ἰοῦσαν', 'ἰοῦσι', 'ἰοῦσιν', 'ἰόν', 'ἰόνθ', 'ἰόντα', 'ἰόντας', 'ἰόντε', 'ἰόντες', 'ἰόντι', 'ἰόντοιν', 'ἰόντος', 'ἰόντων', 'ἰόντ', 'ἰών', 'ἴσθι', 'ἴσθ', 'ἴω', 'ἴωμεν', 'ἴως', 'ἴωσι', 'ἴωσιν', 'ὄν', 'ὄνθ', 'ὄντα', 'ὄντας', 'ὄντε', 'ὄντες', 'ὄντεσσι', 'ὄντι', 'ὄντοιν', 'ὄντος', 'ὄντων', 'ὄντ', 'ὤν', 'ὦ', 'ὦμεν', 'ὦμες', 'ὦμ', 'ὦντι', 'ὦς', 'ὦσι', 'ὦσιν', 'ᾖ', 'ᾖς', 'ᾖς', 'ᾖσθα', 'ᾖσθ', 'ᾖσι', 'ᾖσιν', 'στι', 'στ', 'νθ', 'σαν', 'σθ', 'στί', 'στίν', 'σται', 'στε', 'στι', 'στιν', 'στόν', 'στ'] #check

EIMI_EO = ['εἰσομένη', 'εἰσομένης', 'εἴσατο', 'εἴσατ', 'εἴσεαι', 'εἶ', 'εἶμι', 'εἶμ', 'εἶς', 'εἶσθα', 'εἶσι', 'εἶσιν', 'εἷ', 'εἷμι', 'εῖ', 'εῖς', 'ἤεσαν', 'ἤια', 'ἤιε', 'ἤιει', 'ἤιειν', 'ἤιεν', 'ἤιεσαν', 'ἤιομεν', 'ἤιον', 'ἤῐ', 'ἦια', 'ἦιε', 'ἦιεν', 'ἦιμεν', 'ἦιν', 'ἦι', 'ἰέμεν', 'ἰέναι', 'ἰείη', 'ἰοίη', 'ἰοίην', 'ἰούσης', 'ἰούσῃ', 'ἴασι', 'ἴασιν', 'ἴε', 'ἴεν', 'ἴηι', 'ἴηις', 'ἴησθα', 'ἴησι', 'ἴησιν', 'ἴητε', 'ἴθι', 'ἴθ', 'ἴμεν', 'ἴμεναι', 'ἴμμεναι', 'ἴν', 'ἴναι', 'ἴν', 'ἴοι', 'ἴοιεν', 'ἴοιμεν', 'ἴοιμι', 'ἴοιμ', 'ἴοις', 'ἴοιτε', 'ἴοιτο', 'ἴομεν', 'ἴτε', 'ἴτην', 'ἴτον', 'ἴτω', 'ἴτων', 'ἴτωσαν', 'ἴτ', 'ἴῃ', 'ἴῃς', 'ἴῃσθα', 'ἴῃσι', 'ἴῃσιν', 'ἴ', 'ᾔα', 'ᾔει', 'ᾔειν', 'ᾔεις', 'ᾔεσαν', 'ᾔομεν', 'ᾔτην', 'ᾖα', 'ᾖε', 'ᾖεν', 'ᾖμεν', 'ᾖν', 'ᾖτε', 'ᾖ'] #check

IHMI = ['εἱκώς', 'εἵη', 'εἵην', 'εἵητε', 'εἵκει', 'εἵκω', 'εἵμην', 'εἵς', 'εἷεν', 'εἷθ’', 'εἷκα', 'εἷκε', 'εἷκεν', 'εἷναι', 'εἷντο', 'εἷς’', 'εἷσα', 'εἷσαι', 'εἷσαν', 'εἷσο', 'εἷτο', 'εὗ', 'θάτην', 'οἵατ’', 'οἷο', 'οἷ’', 'οὕτε', 'οὕτων', 'οὕτ’', 'οὗ', 'χοὖ', 'χἄν', 'ἑέμενος', 'ἑέμην', 'ἑείς', 'ἑῆι', 'ἑῆσιν', 'ἑθέν', 'ἑθήσεται', 'ἑθείς', 'ἑῆι', 'ἑῆσιν', 'ἑῇ', 'ἑῇς', 'ἑῇσι', 'ἑῇσιν', 'ἑῶ', 'ἑῶμεν', 'ἕει', 'ἕεις', 'ἕεμαι', 'ἕεμεν', 'ἕεσαι', 'ἕεται', 'ἕετο', 'ἕετον', 'ἕηκα', 'ἕηκαν', 'ἕηκας', 'ἕηκε', 'ἕηκεν', 'ἕημι', 'ἕην', 'ἕης', 'ἕησι', 'ἕησιν', 'ἕθεν', 'ἕθην', 'ἕμεθα', 'ἕμεν', 'ἕμεναι', 'ἕμενος', 'ἕμην', 'ἕν', 'ἕντας', 'ἕντες', 'ἕντο', 'ἕντος', 'ἕο', 'ἕου', 'ἕς', 'ἕσαν', 'ἕσθαι', 'ἕσθε', 'ἕσθην', 'ἕσο', 'ἕτε', 'ἕτο', 'ἕτω', 'ἕῃ', 'ἡκάμην', 'ἥκαμεν', 'ἥκατε', 'ἥκατο', 'ἥκατ’', 'ἥκω', 'ἥσει', 'ἥσειν', 'ἥσεις', 'ἥσεται', 'ἥσετε', 'ἥσομαι', 'ἥσομεν', 'ἥσουσιν', 'ἥσω', 'ἧι', 'ἧις', 'ἧισι', 'ἧισιν', 'ἧκα', 'ἧκαν', 'ἧκας', 'ἧκε', 'ἧκεν', 'ἧκ’', 'ἧς’', 'ἧσθα', 'ἧσθε', 'ἧσθον', 'ἧσθ’', 'ἧσι', 'ἧσιν', 'ἧται', 'ἧτε', 'ἧτον', 'ἧτ’', 'ἧχ’', 'ἰεῖσα', 'ἰεῖσαι', 'ἱέμεθα', 'ἱέμεν', 'ἱέμενα', 'ἱέμεναι', 'ἱέμενοι', 'ἱέμενον', 'ἱέμενος', 'ἱέμεσθα', 'ἱέμην', 'ἱέν', 'ἱέναι', 'ἱέντα', 'ἱέντας', 'ἱέντες', 'ἱέντι', 'ἱέντος', 'ἱέντων', 'ἱέντ’', 'ἱέσθην', 'ἱέτω', 'ἱείη', 'ἱείς', 'ἱείσας', 'ἱείσης', 'ἱεῖσι', 'ἱεῖσιν', 'ἱεισῶν', 'ἱεμένα', 'ἱεμένας', 'ἱεμένη', 'ἱεμένην', 'ἱεμένης', 'ἱεμένοιο', 'ἱεμένοις', 'ἱεμένοισι', 'ἱεμένοισιν', 'ἱεμένου', 'ἱεμένους', 'ἱεμένω', 'ἱεμένων', 'ἱεμένως', 'ἱεμένῃ', 'ἱεμένῳ', 'ἱεῖ', 'ἱεῖς', 'ἱεῖσα', 'ἱεῖσαι', 'ἱεῖσαν', 'ἱεῖσι', 'ἱεῖσιν', 'ἱᾶσι', 'ἱᾶσιν', 'ἵεε', 'ἵεες', 'ἵεθι', 'ἵεθ’', 'ἵει', 'ἵειν', 'ἵεις', 'ἵεμαι', 'ἵεμεν', 'ἵεν', 'ἵενται', 'ἵεντο', 'ἵεντ’', 'ἵεσαι', 'ἵεσαν', 'ἵεσθαι', 'ἵεσθε', 'ἵεσο', 'ἵεται', 'ἵετε', 'ἵετο', 'ἵετ’', 'ἵη', 'ἵηι', 'ἵηις', 'ἵημι', 'ἵην', 'ἵης', 'ἵης’', 'ἵησι', 'ἵησιν', 'ἵητε', 'ἵοιτο', 'ἵω', 'ἵῃ', 'ἷεν', 'ὧ', 'ὧμεν', 'ὧσι', 'ᾗ', 'ᾗς', 'ᾗς’', 'ᾗσι', 'ᾗσιν'] #check

# Remove ambiguous forms for verb lists
EIMI_SUM = [item for item in EIMI_SUM if item not in IRREGULAR_AMBIGUOUS]
EIMI_EO = [item for item in EIMI_EO if item not in IRREGULAR_AMBIGUOUS]
IHMI = [item for item in IHMI if item not in IRREGULAR_AMBIGUOUS]

## Compose dictionaries

# Irregular verbs
EIMI_SUM = {item: 'εἰμί' for item in EIMI_SUM}
EIMI_EO = {item: 'εἶμι' for item in EIMI_EO}
IHMI = {item: 'ἵημι' for item in IHMI}

IRREGULAR_VERBS = dict(ChainMap(EIMI_SUM, EIMI_EO, IHMI))

# Punctuation
PUNCTUATION = {item: 'punc' for item in PUNCTUATION}

# Particles
PARTICLES = {}

for d in _PARTICLES:
    PARTICLES.update({v: k for k, vs in d.items() for v in vs})
    
# Prepositions
PREPOSITIONS = {}

for d in _PREPOSITIONS:
    PREPOSITIONS.update({v: k for k, vs in d.items() for v in vs})

# Create model    
GREEK_MODEL = dict(ChainMap(PARTICLES, PREPOSITIONS, IRREGULAR_VERBS, PUNCTUATION))